app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT 15 OFFSET 0) subquery_for_count

    def set_kind_options_for_select
    @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"