app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.all
---
SELECT "kinds".* FROM "kinds"

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigos"], ["created_at", "2016-10-04 14:14:15.231952"], ["updated_at", "2016-10-04 14:14:15.231952"]]